Revit 2026 API

# ExportFontKeyOriginalFontName Property

---

The original font name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string OriginalFontName { get; set; }
```
```vb
Public Property OriginalFontName As String
	Get
	Set
```
```cpp
public:
property String^ OriginalFontName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member OriginalFontName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportFontKey Class

Autodesk.Revit.DB Namespace